## staging: api_gateway
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 4 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.metrics must be replaced
+/- resource "aws_api_gateway_deployment" "metrics" {
      ~ created_date  = "2021-07-15T18:14:39Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:005133826942:rpjvmf2ukd/" -> (known after apply)
      ~ id            = "a7tkdu" -> (known after apply)
      ~ invoke_url    = "https://rpjvmf2ukd.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "2021-07-15T18:14:38Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_method_settings.method_settings will be created
  + resource "aws_api_gateway_method_settings" "method_settings" {
      + id          = (known after apply)
      + method_path = "save-metrics/POST"
      + rest_api_id = "rpjvmf2ukd"
      + stage_name  = "staging"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = 5000
          + throttling_rate_limit                      = 10000
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # aws_api_gateway_request_validator.metrics_model will be updated in-place
  ~ resource "aws_api_gateway_request_validator" "metrics_model" {
        id                          = "ex8w8v"
      ~ name                        = "create_metrics-validator" -> "save-metrics-validator"
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_resource.create_resource will be updated in-place
  ~ resource "aws_api_gateway_resource" "create_resource" {
        id          = "v2izi2"
      ~ path_part   = "create_metrics" -> "save-metrics"
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_rest_api.metrics will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "metrics" {
        id                           = "rpjvmf2ukd"
      ~ name                         = "create_metrics" -> "save-metrics"
        tags                         = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.metrics will be updated in-place
  ~ resource "aws_api_gateway_stage" "metrics" {
      ~ deployment_id         = "9n7bjn" -> (known after apply)
        id                    = "ags-rpjvmf2ukd-staging"
        tags                  = {}
        # (9 unchanged attributes hidden)

      + access_log_settings {
          + destination_arn = "arn:aws:logs:ca-central-1:005133826942:log-group:API-Gateway-Execution-Logs_rpjvmf2ukd/staging"
          + format          = jsonencode(
                {
                  + caller         = "$context.identity.caller"
                  + httpMethod     = "$context.httpMethod"
                  + ip             = "$context.identity.sourceIp"
                  + protocol       = "$context.protocol"
                  + requestId      = "$context.requestId"
                  + requestTime    = "$context.requestTime"
                  + resourcePath   = "$context.resourcePath"
                  + responseLength = "$context.responseLength"
                  + status         = "$context.status"
                  + user           = "$context.identity.user"
                }
            )
        }
    }

Plan: 2 to add, 4 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url = "https://rpjvmf2ukd.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>